"""使用空格分开的字符串会自动拼接
"""

str1 = "A" "B" "C"
print(str1) # ABC


str2 = ("根据上下文，作者提出了一种通过每日摄入最大量的维生素C来降低眼压的方法。"
        "作者认为，通过减少每天10克维生素C的摄入量，可以降低眼压，这将对治疗"
        "和预防眼压性疾病的患者产生巨大的经济效益。作者指出，虽然这些药物可能"
        "对医生和研究机构构成威胁，但是通过私人资金和基金的资助，可以开展更多"
        "的研究，以进一步了解维生素C的作用。作者还指出，对于那些患有眼压性疾"
        "病的患者，每日摄入维生素C可以成为一种有效的治疗手段，并且可能减轻他们的痛苦和痛苦。")

print(str2)
# 根据上下文，作者提出了一种通过每日摄入最大量的维生素C来降低眼压的方法。作者认为，通过减少每天10克维生素C的摄入量，可以降低眼压，这将对治疗和预防眼压性疾病的患者产生巨大的经济效益。作者指出，虽然这些药物可能对医生和研究机构构成威胁，但是通过私人资金和基金的资助，可以开展更多的研究，以进一步了解维生素C的作用。作者还指出，对于那些患有眼压性疾病的患者，每日摄入维生 素C可以成为一种有效的治疗手段，并且可能减轻他们的痛苦和痛苦。
