"""
不可变类型（immutabel） ，一旦创建就不可修改的对象（值）
    不可变类型: 数字,字符串,元组

数字,字符串不用讨论

简单不可变类型 (1, 2, 3)

简单不可变类型,不管深浅拷贝,都不会开辟新的内存空间,都是引用内存地址(因为内容始终不可变)

"""

import copy


def shallow():
    """
    等号赋值和浅拷贝完全相同
    """
    a = (1, 2, 3)
    b = a

    print("a = ", a, id(a))
    print("b = ", b, id(b))
    # a =  (1, 2, 3) 1955263312376
    # b =  (1, 2, 3) 1955263312376

    c = copy.copy(a)
    print("a = ", a, id(a))
    print("c = ", c, id(c))
    # a =  (1, 2, 3) 1955263312376
    # c =  (1, 2, 3) 1955263312376


# shallow()


def deep():
    """
    等号赋值和深拷贝完全相同
    """
    a = (1, 2, 3)
    b = a

    print("a = ", a, id(a))
    print("b = ", b, id(b))
    # a =  (1, 2, 3) 2176753567784
    # b =  (1, 2, 3) 2176753567784

    c = copy.deepcopy(a)
    print("a = ", a, id(a))
    print("c = ", c, id(c))
    # a =  (1, 2, 3) 2176753567784
    # c =  (1, 2, 3) 2176753567784


deep()
