"""
简单可变类型和不可变类型,切片是深拷贝,产生的地址不同,两者不会影响   list1 = [1, 2, 3, 4]

复杂可变类型,切片对于顶层是深拷贝,对于底层是复制内存地址 list1 = [[1, 2], [3, 4]]

复杂不可变类型,切片是浅拷贝,地址相同                 tuple1 = ([1, 3], [3, 4])
"""


def simpleSection():
    """
    简单可变类型和不可变类型,切片是深拷贝,产生的地址不同,两者不会影响
    """

    list1 = [1, 2, 3, 4, 5, 6, 7]
    list2 = list1[1:3]
    print(list2)  # [2, 3]

    # 不会影响源数据
    list2[0] = 22
    print(list1)  # [1, 2, 3, 4, 5, 6, 7]

    list3 = list1[:]

    print("list1 =", list1, id(list1))
    print("list3 =", list3, id(list3))
    # list1 = [1, 2, 3, 4, 5, 6, 7] 2711859391624
    # list3 = [1, 2, 3, 4, 5, 6, 7] 2711859391944


# simpleSection()


def complexSection1():
    """
    复杂可变类型,切片对于顶层是深拷贝,对于底层是复制内存地址
        和"复杂可变类型浅拷贝"很像
    """

    a = [1, 2]
    b = [11, 22]

    #
    c = [a, b]

    # 切片拷贝
    d = c[:]

    print("c =", c, id(c))
    print("d =", d, id(d))
    # c = [[1, 2], [11, 22]] 2419485426376
    # d = [[1, 2], [11, 22]] 2419485426312

    print("a =", a, id(a))
    print("c[0] =", c[0], id(c[0]))
    print("d[0] =", d[0], id(d[0]))
    # a = [1, 2] 2419485404296
    # c[0] = [1, 2] 2419485404296
    # d[0] = [1, 2] 2419485404296


complexSection1()


def complexSection2():
    """
    复杂不可变类型,切片是浅拷贝,地址相同
    """

    a = [1, 2]
    b = [11, 22]

    #
    c = (a, b)

    # 切片拷贝
    d = c[:]

    print("c =", c, id(c))
    print("d =", d, id(d))
    # c = ([1, 2], [11, 22]) 1908155640072
    # d = ([1, 2], [11, 22]) 1908155640072


# complexSection2()
